{
  "projects": {
    "one": {
      "id": "project1",
      "title": "Local Weather",
      "imageURL": "http://via.placeholder.com/250x250",
      "description": "This app will display weather based on a zipcode the user inputs. The user must register before having access to this app. Data is stored and retrieved from Firebase and will be formatted and displayed on the screen for the user to see. The user can see today's weather or switch to a 5-day forecast.",
      "githubURL": "https://github.com/amillion3/local-weather",
      "liveDemoURL": "https://local-weather.andymillion.com/"
    },
    "two": {
      "id": "project2",
      "title": "Ex-Tracker",
      "imageURL": "http://via.placeholder.com/250x250",
      "description": "This app is used to track my fictional 'exs'. The user is able to search for names or addresses (such as 'Chic-Fil-A' or '6500 Charlotte Pike') via a search box. The user can also filter by the time of day my ex usually frequents those locations. Using jQuery over vanilla JavaScript, the functionality is basic, but important.",
      "githubURL": "https://github.com/amillion3/ex-tracker",
      "liveDemoURL": "https://ex-tracker.andymillion.com/"
    },
    "three": {
      "id": "project3",
      "title": "Nutshell",
      "imageURL": "http://via.placeholder.com/250x250",
      "description": "Our group had 7 days to create a Facebook-like, single page app. Using Firebase, we had to setup authentication, specifically, register and login functionality. Logged in users can use these 5 modules with full CRUD capabilities: messaging, events, tasking, friends, and articles. This is light on the styling, but heavy on the concepts and teamwork.",
      "githubURL": "https://github.com/nss-evening-cohort-7/nutshell-adobe-bricks",
      "liveDemoURL": "https://nutshell-df075.firebaseapp.com/"
    },
    "four": {
      "id": "project4",
      "title": "jQuery Calculator",
      "imageURL": "http://via.placeholder.com/250x250",
      "description": "jQuery Calculator",
      "githubURL": "https://github.com/amillion3/jquery-calculator",
      "liveDemoURL": "https://jquery-calculator.firebaseapp.com/"
    },
    "five": {
      "id": "project5",
      "title": "Sloth",
      "imageURL": "http://via.placeholder.com/250x250",
      "description": "If I had a gun with two bullets and I was in a room with Hitler, Bin Laden, and Toby, I would shoot Toby twice. Just pretend like we're talking until the cops leave. Dwight you ignorant slut. I love catching people in the act. That's why I always whip open doors.",
      "githubURL": "",
      "liveDemoURL": ""
    },
    "six": {
      "id": "project1",
      "title": "Fox",
      "imageURL": "http://via.placeholder.com/250x250",
      "description": "There is no such thing as an appropriate joke, that's why it's a joke. You couldn't handle my undivided attention. Every word out of your mouth is like the squawk of an ugly pelican. I feel God in this Chili's. I sprout mung beans on a damp paper towel in my desk drawer. Very nutritious. But they smell like death.",
      "githubURL": "",
      "liveDemoURL": ""
    }
  }
}
